app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."soundcloud_id" IS NULL LIMIT 1
---
    def show
      # respond_to :json

      @user = User.find_by soundcloud_id: params[:id]